# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [ 5,6, 8,14, 15,11 ]  # P2/4
  - [ 10,13, 16,30, 33,23 ]  # P3/8
  - [ 30,61, 62,45, 59,119 ]  # P4/16
  - [ 116,90, 156,198, 373,326 ]  # P5/32
#  - [10,13, 16,30, 33,23]  # P3/8
#  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 6, 2, 2]],  # 0-P1/2
   [-1, 1, DeformCAConv, [24, 3, 2]],  # 1-P2/4
   [-1, 1, GGhostRegNet, [24, 0]],
   [-1, 1, DeformCAConv, [56, 3, 2]],  # 3-P3/8
   [-1, 1, GGhostRegNet, [56, 1]],
   [-1, 1, DeformCAConv, [152, 3, 2]],  # 5-P4/16
   [-1, 4, GGhostRegNet, [152, 2]],
   [-1, 1, DeformCAConv, [368, 3, 2]],  # 7-P5/32
   [-1, 7, GGhostRegNet, [368, 3]],
   [-1, 1, SPPF, [512, 5]],  # 9
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [[-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, C3, [256, False]],  # 13

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, C3, [128, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P2
   [-1, 1, C3, [64, False]],  # 21 (P2/4-xsmall)

   [-1, 1, DeformCAConv, [64, 3, 2]],
   [[-1, 18], 1, Concat, [1]],  # cat head P3
   [-1, 1, C3, [128, False]],  # 24 (P3/8-small)

   [-1, 1, DeformCAConv, [128, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 1, C3, [256, False]],  # 27 (P4/16-medium)

   [-1, 1, DeformCAConv, [256, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 1, C3, [512, False]],  # 30 (P5/32-large)

   [[21, 24, 27, 30], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
