# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 6, 2, 2]],  # 0-P1/2
   [-1, 1, DeformCAConv, [24, 3, 2]],  # 1-P2/4
   [-1, 1, GGhostRegNet, [24, 0]],
   [-1, 1, DeformCAConv, [56, 3, 2]],  # 3-P3/8
   [-1, 1, GGhostRegNet, [56, 1]],
   [-1, 1, DeformCAConv, [152, 3, 2]],  # 5-P4/16
   [-1, 4, GGhostRegNet, [152, 2]],
   [-1, 1, DeformCAConv, [368, 3, 2]],  # 7-P5/32
   [-1, 7, GGhostRegNet, [368, 3]],
   [-1, 1, SPPF, [512, 5]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [6, 1, Conv, [256, 1, 1]],
   [[-1,-2], 1, Concat_bifpn, [256,256]],  # cat backbone P4
   [-1, 1, C3, [256, False]],  # 14

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [4, 1, Conv, [128, 1, 1]],
   [[-1, -2], 1, Concat_bifpn, [128,128]],  # cat backbone P3
   [-1, 1, C3, [128, False]],  # 19 (P3/8-small)

   [-1, 1,  DeformCAConv, [256, 3, 2]],   # 320, 640 #
   [[-1, 12, 14], 1, Concat_bifpn, [256,256]],  # cat head P4
   [-1, 1, C3, [256, False]],  # 20 (P4/16-medium)

   [-1, 1,  DeformCAConv, [512, 3, 2]], # 640, 1280 #
   [[-1, 9], 1, Concat_bifpn, [512, 512]],  # cat head P5  cat 20,20 #22
   [-1, 1, C3, [512, False]],  # 25 (P5/32-large) # 1280, 1280  #23


   [[17, 20, 23], 1, Detect, [nc, anchors]] # Detect(P3, P4, P5)
  ]