# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# YOLOv5s-repghost summary: 620 layers, 3743705 parameters, 3743705 gradients, 7.1 GFLOPs
#Fusing layers...
# YOLOv5s-repghost summary: 593 layers, 3738921 parameters, 3738921 gradients, 7.1 GFLOPs

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  # args: in_chs, mid_chs, out_chs, dw_kernel_size=3, stride=1, se_ratio=0.0
  [[-1, 1, Conv, [16, 6, 2, 2]],  # 0-P1/2
   [-1, 1, RepGhostBottleneck, [16, 8, 16, 3, 1]],
   [-1, 1, RepGhostBottleneck, [16, 24, 24, 3, 2]],  # 2-P2/4

   [-1, 1, RepGhostBottleneck, [24, 36, 24, 5, 1]],
   [-1, 1, RepGhostBottleneck, [24, 36, 40, 5, 2, 1]],  # 4-P3/8

   [-1, 1, RepGhostBottleneck, [40, 60, 40, 3, 1, 1]],
   [-1, 1, RepGhostBottleneck, [40, 120, 80, 3, 2]],  # 6-P4/16

   [-1, 1, RepGhostBottleneck, [80, 100, 80, 3, 1]],
   [-1, 1, RepGhostBottleneck, [80, 120, 80, 3, 1]],
   [-1, 1, RepGhostBottleneck, [80, 120, 80, 3, 1]],
   [-1, 1, RepGhostBottleneck, [80, 240, 112, 3, 1, 1]],
   [-1, 1, RepGhostBottleneck, [112, 336, 112, 3, 1, 1]],
   [-1, 1, RepGhostBottleneck, [112, 336, 160, 5, 2, 1]],  # 12-P5/32

   [-1, 1, RepGhostBottleneck, [160, 480, 160, 5, 1]],
   [-1, 1, RepGhostBottleneck, [160, 480, 160, 5, 1, 1]],
   [-1, 1, RepGhostBottleneck, [160, 480, 160, 5, 1]],
   [-1, 1, RepGhostBottleneck, [160, 480, 160, 5, 1, 1]],

   [-1, 1, SPPF, [1024, 5]],  # 17
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 11], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 21

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 25 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 22], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 28 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 18], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 31 (P5/32-large)

   [[25, 28, 31], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
