# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

#YOLOv5s-Ghostv2-3-4 summary: 567 layers, 6038517 parameters, 6038517 gradients 7.901  GFLOPs
#forward (ms) 104.5 backward (ms) 183.8

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# Ghostnet backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [16, 3, 2, 1]],                    # 0-P1/2  ch_out, kernel, stride, padding, groups
   [-1, 1, GhostBottleneckV2, [16, 16, 3, 1, 0, 1]],        # 1  ch_out, ch_mid, dw-kernel, stride, ratio

   [-1, 1, GhostBottleneckV2, [24, 48, 3, 2,0 ,1]],        # 2-P2/4
   [-1, 1, GhostBottleneckV2, [24, 72, 3, 1]],        # 3

   [-1, 1, GhostBottleneckV2, [40, 72, 3, 2, 0.25]],  # 4-P3/8
   [-1, 1, GhostBottleneckV2, [40, 120, 3, 1, 0.25]], # 5

   [-1, 1, GhostBottleneckV2, [80, 240, 3, 2]],        # 6-P4/16
   [-1, 3, GhostBottleneckV2, [80, 184, 3, 1]],        # 7
   [-1, 1, GhostBottleneckV2, [112, 480, 3, 1, 0.25]],
   [-1, 1, GhostBottleneckV2, [112, 480, 3, 1, 0.25]],

   [-1, 1, GhostBottleneckV2, [160, 672, 3, 2, 0.25]], # 10-P5/32
   [-1, 1, GhostBottleneckV2, [160, 960, 3, 1]],       # 11
   [-1, 1, GhostBottleneckV2, [160, 960, 3, 1, 0.25]],
   [-1, 1, GhostBottleneckV2, [160, 960, 3, 1]],
   [-1, 1, GhostBottleneckV2, [160, 1024, 3, 1, 0.25]],
#   [-1, 1, Conv, [1024]],

   [-1, 1, SPPF, [1024, 5]], # 15
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 19

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 23 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 20], 1, Concat, [1]], # cat head P4
   [-1, 3, C3, [512, False]],  # 26 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 16], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 29 (P5/32-large)

   [[23, 26, 29], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
