# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.5 # layer channel multiple
anchors: 3
#  - [10,13, 16,30, 33,23]  # P3/8
#  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32

# Ghostnet backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [16, 3, 2, 1]],                    # 0-P1/2  ch_out, kernel, stride, padding, groups
   [-1, 1, GhostBottleneckv1, [16, 16, 3, 1]],        # 1  ch_out, ch_mid, dw-kernel, stride

   [-1, 1, GhostBottleneckv1, [24, 48, 3, 2]],        # 2-P2/4
   [-1, 1, GhostBottleneckv1, [24, 72, 3, 1]],        # 3

   [-1, 1, GhostBottleneckv1, [40, 72, 3, 2, True]],  # 4-P3/8
   [-1, 1, GhostBottleneckv1, [40, 120, 3, 1, True]], # 5

   [-1, 1, GhostBottleneckv1, [80, 240, 3, 2]],        # 6-P4/16
   [-1, 3, GhostBottleneckv1, [80, 184, 3, 1]],        # 7
   [-1, 1, GhostBottleneckv1, [112, 480, 3, 1, True]],
   [-1, 1, GhostBottleneckv1, [112, 480, 3, 1, True]],

   [-1, 1, GhostBottleneckv1, [160, 672, 3, 2, True]], # 10-P5/32
   [-1, 1, GhostBottleneckv1, [160, 960, 3, 1]],       # 11
   [-1, 1, GhostBottleneckv1, [160, 960, 3, 1, True]],
   [-1, 1, GhostBottleneckv1, [160, 960, 3, 1]],
   [-1, 1, GhostBottleneckv1, [160, 960, 3, 1, True]],
   [-1, 1, Conv, [960]],
   [-1, 1, CBAMBlock, [960]],
   [-1, 1, SPPF, [1024, 5]], # 17
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 18
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [9, 1, Conv, [512, 1, 1]], # 20
   [[-1, -2], 1, Concat_bifpn, [256,256]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 22

   [-1, 1, Conv, [256, 1, 1]], # 23
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [5, 1, Conv, [256, 1, 1]], # 25
   [[-2, -1], 1, Concat_bifpn, [128,128]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 27 (P3/8-small)

   [-1, 1, Conv, [128, 1, 1]], # 28
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [3, 1, Conv, [128, 1, 1]], # 30
   [[-2, -1], 1, Concat_bifpn, [64,64]],  # cat backbone P2
   [-1, 3, C3, [128, False]],  # 32 (P3/8-small)

   [ -1, 1, Conv, [ 128, 3, 2 ] ],
   [ 27, 1, Conv, [ 128, 1, 1 ] ], # 34
   [[-2, 28 ,-1 ], 1, Concat_bifpn, [64,64]],  # cat head P3
   [ -1, 3, C3, [ 256, False ] ],  # 36 (P4/16-medium)

   [-1, 1, Conv, [256, 3, 2]],
   [22, 1, Conv, [256, 1, 1]], # 38
   [[-2, 23 ,-1], 1, Concat_bifpn, [128,128]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 40 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [18, 1, Conv, [512, 1, 1]], # 42
   [[-2, -1], 1, Concat_bifpn, [256, 256]],  # cat head P5  cat 20,20 #22
   [-1, 3, C3, [1024, False]],  # 44 (P5/32-large)

   [[32, 36, 40, 44], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]